// app.js
App({
 
  data: {
    furl:'https://www.zhengbaisoft.com/smh',
    //furl:'http://localhost:80/smh',
    url: "https://www.zhengbaisoft.com/smh/wwwroot/tlq/upload/Image/qfimg/",
    navigation: [
      {
        id: 0,
        img: "12.jpg",
        img1: "23.jpg",
        img2: "23.jpg",
        name: "稻田理想",
        address: "江苏省苏州市太仓市双凤镇庆丰村",
        tel: "13773018682",
        latitude: 31.518942,
        longitude: 121.050231,
        details: "“稻花香里话丰年，听取蛙声一片。”庆丰村在绿色优质水稻基地1000亩核心区内打造以“稻田理想  幸福庆丰”为主题的乡村农旅主题景区。以稻田画为主要观光点，配套建设有稻田书屋、小飞屋、观景台、风车、船屋民宿等人文小景……此外，庆丰村勤之力生态养殖场的梅山猪肉质鲜美，营养丰富，远销苏州、上海等地；飞凤食品厂的双凤爊鸡已成为太仓名吃、苏州名牌、国际名品，肉松骨头、香酥肉松也深受广大消费者的喜爱。"
      },
      {
        id: 1,
        img: "7.jpg",
        img1: "7.jpg",
        img2: "18.jpg",
        name: "富华农场育秧基地",
        address: "江苏省苏州市太仓市庆丰横路",
        tel: "13812924509",
        latitude: 31.522372,
        longitude: 121.041053,
        details: "太仓市富华农场专业合作社成立于2010年11月，农场遵循“发展现代高效农业，做美水乡生态产业”的发展理念，围绕生态农业，效益农业，科技农业，走产供销一体化之路，发展现代农业促进强村富民。农场共计5个育秧大棚20000平方米，流水线育秧设备两套，插秧机15台，每年可实现机插秧面积3000多亩。"
      },{
        id: 2,
        img: "13.jpg",
        img1: "13.jpg",
        img2: "22.jpg",
        name: "富华稻米深加工中心",
        address: "江苏省苏州市太仓市上南线",
        tel: "18962629568",
        latitude: 31.513246,
        longitude: 121.048151,
        details: "富华稻米深加工中心是为完善双凤优质大米产供销一体化基础设施建设，提升现代水稻产业园庆丰片区粮食生产经营水平，贯彻落实乡村振兴战略精神，在三产融合中推进农业产业发展，让高质量的双凤大米成为“福地福人品福米”的源产地，在农业产业发展中努力实现“美村美景展美颜”。富华稻米深加工中心分两期建设，从2015年开始建设大米烘干中心，投资总额738万元，建筑面积1150平方米、12套烘干设备，2016年5月开始运行。大米加工及保鲜库项目总投资850万元，占地面积1500平方米。一、大米加工车间630平方米，保鲜库房280平方米，投资486万元；二、大米加工设备共12道工序，投资180万元；三、保鲜仓库585立方米，投资87.7万元；四、钢板仓2座300吨等，投资99.5万元；"
      },
      {
        id: 3,
        img: "20.jpg",
        img1: "20.jpg",
        img2: "21.jpg",
        name: "邨邨乐开心农场",
        address: "江苏省苏州市太仓市纵二路",
        tel: "13061655455",
        latitude: 31.51874,
        longitude: 121.049848,
        details: "邨邨乐开心农场位于双凤镇庆丰村稻田理想园，农场有田头种养、田头餐厅。田头种养，客户可根据自己的需求在邨邨乐开心农场小程序上下单，购买一年期的农田认养权益，成为VIP农场主，每30平方为一个认养单位。VIP享有一年的农田种植权和蔬菜所有权。可通过预约进行线下农耕采摘体验。田头餐厅，是农家土灶餐厅，烧出最质朴最传统的农家风味，即采即吃是餐厅的重点，也是设餐厅的目的。客人可以参与全过程，自主加工、委托加工、纯点菜等多种体验方式。"
      }, 
      {
        id: 4,
        img: "24.jpg",
        img1: "24.jpg",
        img2: "25.jpg",
        name: "飞凤工厂店",
        address: "江苏省苏州市太仓市飞凤路120附近",
        tel: "0512-53439727",
        latitude: 31.527913,
        longitude: 121.038802,
        details: " 太仓市飞凤食品有限公司，成立于1997年，公司位于风景秀丽的生态城市——太仓市双凤镇。公司占地面积为5667平方米，公司建有苏州市畜禽制品深加工工程技术研发中心和江苏省级研究生工作站，并与江南大学签订了长期的产学研合作协议，另还和苏州大学、江苏食品职业技术学院合作，为公司提供了专业的技术支撑。经过专业、专心、专注打造，公司产品形成了江南特色的“太仓肉松”、“太仓肉松骨头”、“双凤爊鸡”、“叫花鸡”、“太仓糟油鸡”、“太仓糟鱼干”等5大系列，60多个品种。公司分别在江苏、江西、山东建立了原料供应基地。公司的“双凤爊鸡”、“糟油鸡”、和“飞凤”商标获得“江苏省名牌产品“，”飞凤”获得了 “江苏省著名商标”称号。公司与沃尔玛、大润发、乐天玛特、欧尚、世纪联华、吉买盛等建立于长期营销合作关系，产品畅销全国各地。"
      },
    ],
    mall: [
      {
        id:0,
        name: "优质大米",
        money: 30,
        img: "40.jpg",
        type:"谷类",
        introduction:"3元一斤,10斤/袋",
        tel:"13952422480"
      },
      {
        id:1,
        name: "福地鸡",
        money: 150,
        img: "48.jpg",
        type:"家禽",
        introduction:"草鸡,150元/只",
        tel:"13952422480"
      }, {
        id:2,
        name: "袋装爊鸡",
        money: 57.6,
        img: "47.jpg",
        type:"肉类",
        introduction:"1200g/袋,1*12",
        tel:"13952422480"
      }, {
        id:3,
        name: "袋装肉松骨头",
        money: 47.2,
        img: "46.jpg",
        type:"肉类",
        introduction:"800g/袋,1*12",
        tel:"13952422480"
      }, {
        id:4,
        name: "袋装酱鸭",
        money: 28,
        img: "45.jpg",
        type:"肉类",
        introduction:"650克/袋,1*16",
        tel:"13952422480"
      }, {
        id:5,
        name: "叫花鸡",
        money: 25.6,
        img: "44.jpg",
        type:"肉类",
        introduction:"600克/袋,1*16",
        tel:"13952422480"
      },
      {
        id:6,
        name: "糟油鸡",
        money: 19.2,
        img: "43.jpg",
        type:"肉类",
        introduction:"380克/袋,1*12",
        tel:"13952422480"
      },
      {
        id:7,
        name: "糟鱼干",
        money: 12,
        img: "41.jpg",
        type:"鱼类",
        introduction:"120克/袋,1*25",
        tel:"13952422480"
      },
      {
        id:8,
        name: "袋装肉松",
        money: 56,
        img: "42.jpg",
        type:"肉类",
        introduction:"228g/袋,1*6",
        tel:"13952422480"
      }
    ]
  },
  onLaunch() {
    // 展示本地存储能力
    const logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)
   //云开发初始化
   wx.cloud.init({
          env:"cloud1-3grh7ay992ea307c"
      })
  },
  globalData: {
    userInfo: null
  }
})